app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "icon", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["icon", ""], ["created_at", "2023-02-25 18:35:07.922261"], ["updated_at", "2023-02-25 18:35:07.922261"], ["user_id", 1]]
---
    def create
      @category = current_user.categories.create(category_params)