app/controllers/transactions_controller.rb

    def index
      @category = Category.find(params[:category_id])
      @transactions = @category.transactions.order(created_at: :desc)
      @total_money = @transactions.sum(:amount)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."category_id" = $1 ORDER BY "transactions"."created_at" DESC  [["category_id", 3]]
SELECT SUM("transactions"."amount") FROM "transactions" WHERE "transactions"."category_id" = $1  [["category_id", 3]]

    def new
      # @funding = Funding.new
      @user = current_user
      @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
      @transaction = Transaction.new(transaction_params)
      @transaction.user_id = current_user.id
      @transaction.category_id = Category.find_by_id(params[:category_id]).id
      respond_to do |format|
        if @transaction.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "transactions" ("name", "amount", "created_at", "updated_at", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Dolph"], ["amount", 4], ["created_at", "2023-02-25 19:11:55.383973"], ["updated_at", "2023-02-25 19:11:55.383973"], ["user_id", 2], ["category_id", 3]]